openfoam_cases/cavity/system/FOs/FOenstrophy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

enstrophy1
{
    // Mandatory entries
    type            enstrophy;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    field           U;
    result          enstrophyField;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.25;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 5;
    writeControl    timeStep;
    writeInterval   25;
}


// ************************************************************************* //
